deneyapkart/deneyapkart-arduino-core/boards.txt
##############################################################

#dym_mpv20.name=Deneyap Mini v2
#
#dym_mpv20.vid.0=0x303A
#dym_mpv20.pid.0=0x8144
#
#dym_mpv20.bootloader.tool=esptool_py
#dym_mpv20.bootloader.tool.default=esptool_py
#
#dym_mpv20.upload.tool=esptool_py
#dym_mpv20.upload.tool.default=esptool_py
#dym_mpv20.upload.tool.network=esp_ota
#
#dym_mpv20.upload.maximum_size=1310720
#dym_mpv20.upload.maximum_data_size=327680
#dym_mpv20.upload.flags=
#dym_mpv20.upload.extra_flags=
#dym_mpv20.upload.use_1200bps_touch=false
#dym_mpv20.upload.wait_for_upload_port=false
#
#dym_mpv20.serial.disableDTR=false
#dym_mpv20.serial.disableRTS=false
#
#dym_mpv20.build.tarch=xtensa
#dym_mpv20.build.bootloader_addr=0x1000
#dym_mpv20.build.target=esp32s2
#dym_mpv20.build.mcu=esp32s2
#dym_mpv20.build.core=esp32
#dym_mpv20.build.variant=dym_mpv20
#dym_mpv20.build.board=DYMv2
#
#dym_mpv20.build.serial=0
#dym_mpv20.build.f_cpu=240000000L
#dym_mpv20.build.flash_size=4MB
#dym_mpv20.build.flash_freq=80m
#dym_mpv20.build.flash_mode=qio
#dym_mpv20.build.boot=qio
#dym_mpv20.build.partitions=default
#dym_mpv20.build.defines=
#
#dym_mpv20.menu.CDCOnBoot.default=Enabled
#dym_mpv20.menu.CDCOnBoot.default.build.cdc_on_boot=1
#dym_mpv20.menu.CDCOnBoot.cdc=Disabled
#dym_mpv20.menu.CDCOnBoot.cdc.build.cdc_on_boot=0
#
#dym_mpv20.menu.MSCOnBoot.default=Disabled
#dym_mpv20.menu.MSCOnBoot.default.build.msc_on_boot=0
#dym_mpv20.menu.MSCOnBoot.msc=Enabled
#dym_mpv20.menu.MSCOnBoot.msc.build.msc_on_boot=1
#
#dym_mpv20.menu.DFUOnBoot.default=Disabled
#dym_mpv20.menu.DFUOnBoot.default.build.dfu_on_boot=0
#dym_mpv20.menu.DFUOnBoot.dfu=Enabled
#dym_mpv20.menu.DFUOnBoot.dfu.build.dfu_on_boot=1
#
#dym_mpv20.menu.PSRAM.enabled=QSPI PSRAM
#dym_mpv20.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
#dym_mpv20.menu.PSRAM.enabled.build.psram_type=qspi
#dym_mpv20.menu.PSRAM.disabled=Disabled
#dym_mpv20.menu.PSRAM.disabled.build.defines=
#dym_mpv20.menu.PSRAM.disabled.build.psram_type=qspi
#dym_mpv20.menu.PSRAM.opi=OPI PSRAM
#dym_mpv20.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
#dym_mpv20.menu.PSRAM.opi.build.psram_type=opi
#
#dym_mpv20.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
#dym_mpv20.menu.PartitionScheme.default.build.partitions=default
#dym_mpv20.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
#dym_mpv20.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
#dym_mpv20.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
#dym_mpv20.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
#dym_mpv20.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
#dym_mpv20.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
#dym_mpv20.menu.PartitionScheme.minimal.build.partitions=minimal
#dym_mpv20.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
#dym_mpv20.menu.PartitionScheme.no_ota.build.partitions=no_ota
#dym_mpv20.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
#dym_mpv20.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
#dym_mpv20.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
#dym_mpv20.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
#dym_mpv20.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
#dym_mpv20.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
#dym_mpv20.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
#dym_mpv20.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
#dym_mpv20.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
#dym_mpv20.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
#dym_mpv20.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
#dym_mpv20.menu.PartitionScheme.huge_app.build.partitions=huge_app
#dym_mpv20.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
#dym_mpv20.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
#dym_mpv20.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
#dym_mpv20.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
#dym_mpv20.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
#dym_mpv20.menu.PartitionScheme.fatflash.build.partitions=ffat
#dym_mpv20.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
#dym_mpv20.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
#dym_mpv20.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
#dym_mpv20.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
#dym_mpv20.menu.PartitionScheme.rainmaker=RainMaker
#dym_mpv20.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
#dym_mpv20.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728
#
#dym_mpv20.menu.CPUFreq.240=240MHz (WiFi)
#dym_mpv20.menu.CPUFreq.240.build.f_cpu=240000000L
#dym_mpv20.menu.CPUFreq.160=160MHz (WiFi)
#dym_mpv20.menu.CPUFreq.160.build.f_cpu=160000000L
#dym_mpv20.menu.CPUFreq.80=80MHz (WiFi)
#dym_mpv20.menu.CPUFreq.80.build.f_cpu=80000000L
#dym_mpv20.menu.CPUFreq.40=40MHz
#dym_mpv20.menu.CPUFreq.40.build.f_cpu=40000000L
#dym_mpv20.menu.CPUFreq.20=20MHz
#dym_mpv20.menu.CPUFreq.20.build.f_cpu=20000000L
#dym_mpv20.menu.CPUFreq.10=10MHz
#dym_mpv20.menu.CPUFreq.10.build.f_cpu=10000000L
#
#dym_mpv20.menu.FlashMode.qio=QIO 80MHz
#dym_mpv20.menu.FlashMode.qio.build.flash_mode=dio
#dym_mpv20.menu.FlashMode.qio.build.boot=qio
#dym_mpv20.menu.FlashMode.qio.build.boot_freq=80m
#dym_mpv20.menu.FlashMode.qio.build.flash_freq=80m
#dym_mpv20.menu.FlashMode.qio120=QIO 120MHz
#dym_mpv20.menu.FlashMode.qio120.build.flash_mode=dio
#dym_mpv20.menu.FlashMode.qio120.build.boot=qio
#dym_mpv20.menu.FlashMode.qio120.build.boot_freq=120m
#dym_mpv20.menu.FlashMode.qio120.build.flash_freq=80m
#dym_mpv20.menu.FlashMode.dio=DIO 80MHz
#dym_mpv20.menu.FlashMode.dio.build.flash_mode=dio
#dym_mpv20.menu.FlashMode.dio.build.boot=dio
#dym_mpv20.menu.FlashMode.dio.build.boot_freq=80m
#dym_mpv20.menu.FlashMode.dio.build.flash_freq=80m
#dym_mpv20.menu.FlashMode.opi=OPI 80MHz
#dym_mpv20.menu.FlashMode.opi.build.flash_mode=dout
#dym_mpv20.menu.FlashMode.opi.build.boot=opi
#dym_mpv20.menu.FlashMode.opi.build.boot_freq=80m
#dym_mpv20.menu.FlashMode.opi.build.flash_freq=80m
#
#dym_mpv20.menu.FlashFreq.80=80MHz
#dym_mpv20.menu.FlashFreq.80.build.flash_freq=80m
#dym_mpv20.menu.FlashFreq.40=40MHz
#dym_mpv20.menu.FlashFreq.40.build.flash_freq=40m
#
#dym_mpv20.menu.FlashSize.4M=4MB (32Mb)
#dym_mpv20.menu.FlashSize.4M.build.flash_size=4MB
#
#dym_mpv20.menu.UploadMode.default=Internal USB
#dym_mpv20.menu.UploadMode.default.upload.use_1200bps_touch=true
#dym_mpv20.menu.UploadMode.default.upload.wait_for_upload_port=true
#dym_mpv20.menu.UploadMode.default.upload.mode=default_reset
#dym_mpv20.menu.UploadMode.cdc=UART0
#dym_mpv20.menu.UploadMode.cdc.upload.use_1200bps_touch=false
#dym_mpv20.menu.UploadMode.cdc.upload.wait_for_upload_port=false
#dym_mpv20.menu.UploadMode.cdc.upload.mode=default_reset
#
#dym_mpv20.menu.UploadSpeed.921600=921600
#dym_mpv20.menu.UploadSpeed.921600.upload.speed=921600
#dym_mpv20.menu.UploadSpeed.115200=115200
#dym_mpv20.menu.UploadSpeed.115200.upload.speed=115200
#dym_mpv20.menu.UploadSpeed.256000.windows=256000
#dym_mpv20.menu.UploadSpeed.256000.upload.speed=256000
#dym_mpv20.menu.UploadSpeed.230400.windows.upload.speed=256000
#dym_mpv20.menu.UploadSpeed.230400=230400
#dym_mpv20.menu.UploadSpeed.230400.upload.speed=230400
#dym_mpv20.menu.UploadSpeed.460800.linux=460800
#dym_mpv20.menu.UploadSpeed.460800.macosx=460800
#dym_mpv20.menu.UploadSpeed.460800.upload.speed=460800
#dym_mpv20.menu.UploadSpeed.512000.windows=512000
#dym_mpv20.menu.UploadSpeed.512000.upload.speed=512000
#
#dym_mpv20.menu.DebugLevel.none=None
#dym_mpv20.menu.DebugLevel.none.build.code_debug=0
#dym_mpv20.menu.DebugLevel.error=Error
#dym_mpv20.menu.DebugLevel.error.build.code_debug=1
#dym_mpv20.menu.DebugLevel.warn=Warn
#dym_mpv20.menu.DebugLevel.warn.build.code_debug=2
#dym_mpv20.menu.DebugLevel.info=Info
#dym_mpv20.menu.DebugLevel.info.build.code_debug=3
#dym_mpv20.menu.DebugLevel.debug=Debug
#dym_mpv20.menu.DebugLevel.debug.build.code_debug=4
#dym_mpv20.menu.DebugLevel.verbose=Verbose
#dym_mpv20.menu.DebugLevel.verbose.build.code_debug=5
#
#dym_mpv20.menu.EraseFlash.none=Disabled
#dym_mpv20.menu.EraseFlash.none.upload.erase_cmd=
#dym_mpv20.menu.EraseFlash.all=Enabled
#dym_mpv20.menu.EraseFlash.all.upload.erase_cmd=-e

